using System;

namespace Recursion_task4
// Написать алгоритм для нахождения первых n чисел Фибонначи. Делать Assert для последнего рассчитанного числа. Использовать рекурсию.
{
    class Fibonachi {
    
    }
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Enter a number: ");
            int n = Console.ReadLine();
            
        }
    }
}
